import { m2oMap } from '../tools/m2oMap'

export const vowelPhonemeMap = m2oMap([
  /* 介音，后面可能会接其他vowel phoneme */
  [['i', 'yi'], '⿱一'],
  [['u', 'wu'], '⿱五'],
  [['v', 'ü', 'yu'], '⿱雨'],
  // 不存在的韵尾
  [['ie', 'ye'], '也'],
  [['ve', 'üe', 'yue'], '月'],
  /* （2.2）须提前 */
  ['en', '⿵冂'],
  ['an', '⿵𰃦'],
  ['eng', '⿹𠃌'],
  ['ang', '⿹勹'],
  /* （2.3）零声母是前面加上‘丨’ */
  [['-a', 'ba'], '八'],
  [['-wo', 'uo', 'huo'], '火'],
  [['-e', 'ge'], '戈'],
  [['-ai', 'cai'], '才'],
  [['-ei', 'pei'], '巿'],
  [['-ao', 'dao'], '刀'],
  [['-ou', '-o', 'kou'], '口'],
  // 无零声母
  [['-ong', 'gong'], '工'],
  // 只做零声母
  ['er', '耳'],
  // 整体
  [['yong', 'iong'], '用'],
])

export const consonantPhonemeMap = m2oMap([
  // 零声母
  ['', '⿰丨'],
  // 象形
  ['g', '⿰𠂎'],
  ['k', '⿰丬'],
  ['h', '⿰丩'],
  ['d', '⿱𠂊'],
  ['t', '⿰七'],
  ['n', '⿱冖'],
  ['l', '⿺𠃊'],
  // 无介音u
  [['b', 'bu'], '⿱不'],
  [['p', 'pu'], '⿱攵'],
  [['m', 'mu'], '⿰木'],
  [['f', 'fu'], '⿱父'],
  // 默认介音i
  [['j', 'ji'], '⿱几'],
  [['q', 'qi'], '⿱七'],
  [['x', 'xi'], '⿱西'],
  // 假声母i
  [['z', 'zi'], '⿰子'],
  [['c', 'ci'], '⿰朿'],
  [['s', 'si'], '⿱四'],
  [['r', 'ri'], '⿰日'],
  [['zh', 'zhi'], '⿱止'],
  [['ch', 'chi'], '⿱尺'],
  [['sh', 'shi'], '⿸尸'],
])
